{
  "positions": [
    {
      "current": true,
      "title": "Front End Developer",
      "company": "Expeditors International of Washington, Inc.",
      "dateStart":"2017-03-20T00:00:00Z",
      "dateEnd":"",
      "description": "Create a functional implementation of the user interface based on static mockups provided by User Experience Design. Ensure UI components and technologies are feasible and ensure consistency across browsers. Work with application developers to identify integration points between view layer and back end. Provide oversight to other developers contributing to the user interface to ensure the interface is developed consistently and utilizes best practices. Create templates, examples, and components for application developers to use as needed. Work together with User Experience Design and Business Analysis to present ideas to business owners.",
      "highlights": [
        "Implemented a Mattermost Chatbot with Typescript and Node.js to provide teammates with an easy way to monitor the system, and alert them to codebase issues.",
        "Built and maintain a webapp with Angular and Redux to provide business with a way to interact with the po repository system."
      ]
    },
    {
      "current": false,
      "title": "Developer III",
      "company": "Expeditors International of Washington, Inc.",
      "dateStart":"2012-08-12T00:00:00Z",
      "dateEnd":"2017-03-20T00:00:00Z",
      "description": "Collaborate with systems analyst to develop, test, and deploy EDI translations to ensure successful transmission of messages within the company, between clients, and between government entities. Perform system research as needed. Serve on after-hours on-call rotation. Mentor developers new to the company. Use innovation time to enhance existing Java applications as needed.",
      "highlights": [
        "Traveled to Chennai, India for three months to assist in opening of new regional development center by training and mentoring three developers in webMethods EDI development.",
        "Led team tasked with daytime maintenance and troubleshooting of issues with the EDI systems.",
        "Coordinated development projects for the Customs business queue.",
        "Coordinated initial training of EDI development team, initial roll out, and documentation of the EDIGen Java IDE. Assisted development and rollout of version 2.0.",
        "Helped to redesign technical portion of interview for new developers."
      ]
    },
    {
      "current": false,
      "title": "Java Certificate Teaching Assistant",
      "company": "University of Washington - Professional and Continuing Education",
      "dateStart":"2015-10-01T00:00:00Z",
      "dateEnd":"2015-12-01T00:00:00Z",
      "description": "Assisted professor for introduction to Java Programming course by grading approximately 15 homework assignments a week during the 10 week course.",
      "highlights": [
        "Collaborated with professor to ensure that all students were being held to same expectation for homework quality.",
        "Answered clarifying questions submitted by students along with homework.",
        "Provided feedback for how students could improve code quality.",
        "Troubleshooted root cause of issues when student homework assignments didn't function as expected and provided this feedback to the students so they could learn from their mistakes."
      ]
    },
    {
      "current": false,
      "title": "Executive President",
      "company": "Residence Hall Association at Washington State University",
      "dateStart":"2009-05-01T00:00:00Z",
      "dateEnd":"2011-05-01T00:00:00Z",
      "description": "Served as chief representative of the Association to the University, an organization with ~ $80,000/yearly budget. Ran two weekly meetings. Knowledgeable of all goings on within organization and the rest of campus. Sit on various committees and task force boards with different campus organizations.",
      "highlights": [
        "Also served as Director of Technology and Marketing 2012, RHA Constitutional Review Chair 2009, and Waller Hall VP 2008-2009."
      ]
    },
    {
      "current": false,
      "title": "SPF State Incentive Grant Database Technician",
      "company": "Franklin Pierce School District",
      "dateStart":"2008-07-01T00:00:00Z",
      "dateEnd":"2008-08-31T00:00:00Z",
      "description": "Prepared Community Survey for electronic distribution, input both Curriculum and Community Surveys into Access database, communicated with project evaluator as needed. Prepared Community Surveys for bulk mailing.",
      "highlights": [
        "Contracted Position"
      ]
    }
  ],
  "skills": [
    {
      "name": "Web Development",
      "highlights": [
        "HTML",
        "Javascript/ES6",
        "TypeScript",
        "Node.js",
        "CSS/Sass",
        "Angular",
        "Redux/ngrx",
        "REST",
        "JQuery"
      ]
    },
    {
      "name": "Application Development",
      "highlights": [
        "WebMethods",
        "Java"
      ]
    },
    {
      "name": "Version Control",
      "highlights": [
        "Git",
        "Svn"
      ]
    }
  ],
  "degrees": [
    {
      "name": "Washington State University",
      "degree": "Business Administration - Management Information Systems, Bachelor of Arts",
      "startDate": "2007-08-01T00:00:00Z",
      "endDate": "2012-08-01T00:00:00Z",
      "minors": [
        "German Minor",
        "Music Composition Minor"
      ]
    },
    {
      "name": "University of Washington - Professional and Continuing Education",
      "degree": "Certificate of Java Programming",
      "startDate": "2014-08-01T00:00:00Z",
      "endDate": "2015-06-01T00:00:00Z"
    },
    {
      "name": "Freie Universität Berlin",
      "degree": "FU-BEST Education Abroad Program",
      "startDate": "2011-08-01T00:00:00Z",
      "endDate": "2011-12-01T00:00:00Z"
    }
  ],
  "awards": [
    {
      "name": "Notice of Appreciation – Canadian Border Services Agency Project",
      "awardingOrg": "Expeditors International of Washington, Inc.",
      "date": "2014-09-01T00:00:00Z",
      "description": "Awarded for work as lead developer on a project to interface with Canadian Customs new Border Services system. Despite extreme complexity and rapidly changing timelines dictated by both internal customers and the Canadian Government, we became one of the first companies able to exchange messages successfully with the new system."
    },
    {
      "name": "President’s Award for Distinguished Leadership and Service",
      "awardingOrg": "Washington State University",
      "date": "2010-05-01T00:00:00Z",
      "description": "The President’s Award for Leadership is an honor bestowed annually to students and others who advance leadership and engagement at WSU. Awarded to less than 1% of the entire WSU student body."
    },
    {
      "name": "Eagle Scout Award",
      "awardingOrg": "Boy Scouts of America - Pacific Harbors Council",
      "date": "2007-06-01T00:00:00Z",
      "description": ""
    }
  ],
  "projects": [
    {
      "name": "Timerize",
      "inProgress": false,
      "url": "https://github.com/bniedermeyer/timerize",
      "description": "A time tracking app to track how long you spend on different activities or projects during the day. Built Timer class to track passage of time and perform basic timer functions.",
      "technologiesUsed": [
        "React.js",
        "ES6",
        "Sass",
        "JQuery"
      ]
    },
    {
      "name": "Seattle Counselors Association",
      "inProgress": true,
      "url": "",
      "description": "Work with members of a local meetup group to build a new website for a local non-profit. Finished product will allow members of the association to advertise counseling services, provide member management, and allow users to search for a local counselor suited for their needs.",
      "technologiesUsed": [
        "Bubble.is"
      ]
    },
    {
      "name": "WizQuote",
      "inProgress": false,
      "url": "",
      "description": "Built a Node.js based web app for a fake website that would assist users in finding car insurance.",
      "technologiesUsed": [
        "Node.js",
        "Express",
        "JQuery",
        "MongoDB",
        "Bootstrap"
      ]
    },
    {
      "name": "Wikipedia Viewer",
      "inProgress": false,
      "url": "https://codepen.io/bniedermeyer/pen/GZKOpJ",
      "description": "A simple Wikipedia viewer that allows the user to view a random article or search for a specific article by using Wikipedia's search API."
    },
    {
      "name": "Calculator",
      "inProgress": false,
      "url": "https://codepen.io/bniedermeyer/pen/RrwmzL",
      "description": "A simple calculator built with JQuery."
    }
  ]
}
